---
kind: other
id: Properties.T:Autodesk.Revit.UI.Selection.Selection
source: html/7d89cd92-7b19-1fbe-26e5-d7291346438e.htm
---
# Selection Properties

Specifies whether the .NET object represents a valid Revit entity.